<div id = "main">
	<p class = "tit">Математический анализ</p>
	<ol>
	  <li> Понятие предела числовой последовательности в <img src=students/formuls/2.jpg>. Критерий Коши. Сходимость последовательностей комплексных
       	   чисел. Общее понятие сходимости последовательности в метрическом пространстве.</li>
      <li> Окрестность точки на прямой, плоскости и в пространстве. Понятие об открытом и замкнутом множестве. 
	       Свойства открытых и замкнутых множеств в <img src=students/formuls/3.jpg>  и в метрическом пространстве.</li>
      <li> Непрерывность функций числового аргумента. Свойства непрерывных функций. Непрерывные функции комплексной 
	       переменной.</li>
      <li> Дифференцируемость функций одной вещественной переменной. Теоремы Ролля и Коши. Критические точки гладкой 
	       функции. Дифференцируемость векторных функций вещественной переменной.</li>
      <li> Дифференцируемость вещественных функций многих переменных. Частные производные и дифференциал. Условия 
	       дифференцируемости.</li>
      <li> Производные высших порядков. Смешанные производные. Дифференциалы высших порядков. Теорема о смешанной 
	       производной.</li>
      <li> Комплексная дифференцируемость. Условия Коши-Римана. Аналитические (голоморфные) функции и их свойства.</li>
      <li> Интеграл Римана функций одной переменной. Интегральные суммы. Условия интегрируемости.</li>
      <li> Первообразная. Теорема Ньютона - Лейбница. Дифференцируемость интеграла от непрерывной функции по верхнему
           пределу.</li>
      <li> Криволинейные интегралы на плоскости и в пространстве. Условия независимости криволинейного интеграла от 
	       пути. Теорема Коши об интеграле функции.</li>
      <li> Понятия о двойном и тройном интегралах. Критерии интегрируемости. Поверхностные интегралы. Теорема 
	       Остроградского и Стокса.</li>
      <li> Числовые ряды. Вещественные и комплексные ряды. Сходимость и суммы ряда. Основные признаки сходимости 
	       рядов. Абсолютная и условная сходимости.</li>
	  <li> Функциональные ряды. Простая (поточечная) и равномерная сходимость рядов. Теоремы Вейерштрасса о 
	       равномерной сходимости аналитических функций.</li>
      <li> Степенные ряды и их область сходимости. Ряды Тейлора и Лорана.</li>
      <li> Непрерывные операторы в метрическом пространстве. Сжимающие отображения. Принцип сжимающих отображений и 
	       его применение.</li>
    </ol>
	
</div>
