<div id = "main">
	<p class = "tit">Информационные системы</p>
	<ol>
		<li> Формы представления конечных автоматов.</li>
		<li> Автоматное отображение.</li>
      		<li> Автономные и инициальные автоматы.</li>
      		<li> Преобразование форм представления конечных автоматов.</li>
      		<li> Частичные автоматы.</li>
      		<li> Автоматы Мили и Мура.</li>
      		<li> Графы-источники конечных автоматов</li>
      		<li> Алгебра регулярных событий. Представление символьных последовательностей регулярными выражениями. </li>
      		<li> Распределенные системы.</li>
      		<li> Топология сетей.</li>
      		<li> Линии связи.</li>
      		<li> Структуризация сетей.</li>
	  	<li> «Открытая система» и стандартизация сетей.</li>
    	</ol>
</div>
