<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Алгебра и аналитическая геометрия</p>
	<ol>
		<li> Свойства перестановок и определителей. Миноры и алгебраические дополнения.<br> 
		     Правило Крамера. Система nлинейных однородных уравнений с n неизвестными.</li>
      		<li> Линейная зависимость векторов в арифметическом пространстве <img src=students/formuls/1.jpg>. 
		     Базис и размерность пространства. Ранг матрицы, вычисление ранга матрицы. Элементарные 
		     преобразования матриц.</li>
      		<li> Системы линейных алгебраических уравнений. Совместность системы. Правило решения произвольной системы 
	       	     линейных уравнений. Однородные системы. Фундаментальная система решений.</li>
      		<li> Линейное пространство над произвольным полем. Линейные подпространства, линейная оболочка.</li>
      		<li> Линейные функционалы и линейные операторы в евклидовом пространстве.</li>
      		<li> Матрицы и операции над ними. Ранг матрицы. Обратные матрицы. Применение матриц при решении систем 
	       	     линейных уравнений.</li>
      		<li> Квадратичные формы. Изменение матрицы формы при линейном преобразовании переменных. Приведение 
	       	     квадратичной формы к каноническому виду. Закон инерции. </li>
      		<li> Положительно определенные квадратичные формы. Критерий положительной определенности.</li>
      		<li> Ортогональные преобразования. Проекция вектора на подпространство. Приведение к каноническому виду 
	       	     пары квадратичных форм. Ортонормированная система собственных векторов. Свойства симметрической матрицы. 
		     Приведение квадратичной формы к главным осям.</li>
      		<li> Уравнение прямой на плоскости и в пространстве. Пучки и связки прямых. Критерии параллельности и 
	       	     перпендикулярности прямых.</li>
      		<li> Уравнения плоскости в пространстве. Пучки и связки плоскостей. Критерии параллельности и перпендикулярности
     	   	     плоскостей. Расстояние от точки до плоскости.</li>
      		<li> Уравнения эллипса, параболы и гиперболы в координатах. Геометрические свойства этих кривых.</li>
      		<li> Кривые второго порядка. Классификация кривых 2-го порядка. Приведение кривых 2-го порядка к каноническому 
	       	     виду.</li>
    	</ol>
	
</div>
