<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Системное и прикладное программное обеспечение</p>
	<b>Тема 1. Система программного обеспечения ЭВМ.</b>
	<ol>
		<li> Концептуальные основы математического обеспечения ЭВМ: Базовые определения. Соответствие понятий "МО ЭВМ" и 
	       	     "ПО ЭВМ". СПО и ППО.</li>
      		<li> Понятие виртуальной ЭВМ. Интеграция программных и аппаратных средств ЭВМ. Архитектура виртуальной ЭВМ.</li>
      		<li> Системное программное обеспечение: назначение, состав, функции компонентов.</li>
      		<li> Прикладное программное обеспечение: назначение, состав, функции компонентов.</li>
      		<li> Иерархия языков программирования.</li>
      		<li> Операционная система: назначение, архитектура.</li>
      		<li> Средства, расширяющие возможности операционной системы. </li>
    	</ol>
	<b>Тема 2. Операционные среды информационных систем.</b>
	<ol>
	  	<li> Операционная среда ЭВМ. Системы MS DOS, MS Windows (обобщение на примерах операционных систем Windows 3.x, 
	       	     Windows 9.x, Windows 2000).</li>
      		<li> DOS - среда. Настройка операционной среды MS DOS. Файлы конфигурации Config.sys, Autoexec.bat.</li>
      		<li> Загрузка операционной системы.</li>
      		<li> Уровни внутренней памяти ЭВМ. Конфигурирование памяти. Драйверы Himem.sys, EMM386.ехе.</li>
      		<li> Многовариантная конфигурация системы: Меню загрузки. Определение блоков конфигураций. Изменения в файле 
	       	     Autoexec.bat  при работе с несколькими конфигурациями.</li>
    	</ol>
	<b>Тема 3. Windows-среда</b>
	<ol>
		<li> Системное конфигурирование Windows: Автоматическое распознавание оборудования (метод Plug and Play). 
	       	     Мастера установки (wizardz). Конфигурирование системы с помощью Панели управления (Control Panel).</li>
      		<li> Классы устройств в Windows: Disk, Display, Keyboard,  Modem, Mouse, Multimedia, PCMCA, Ports, Printers, 
	       	     System, Unknown Devices.</li>
      		<li> Файлы инициализации в Windows: system.ini, win.ini. Назначение, структура, использование файлов 
		     инициализации.</li>
      		<li> Файлы Реестра Windows. Администрирование вычислительных сетей на основе Реестра.</li>
      		<li> Конфигурирование жесткого диска. Утилита Fdisk.</li>
      		<li> Обслуживание жесткого диска с помощью системных средств ScanDisk, DiskDwfragmenter.</li>
      		<li> Файлы подкачки.</li>
      		<li> Управление драйверами в Windows (установка, настройка): Системные драйверы. Устанавливаемые драйверы 
	       	     устройств. Драйверы реального и защищенного режима. Типовые драйверы инсталляции Windows. 
		     Замена драйверов в Windows. Установка новых драйверов. </li>
      		<li> Управление принтером: Подключение принтера. Метод Point and Print. Настройка принтера. Работа с диспетчером 
	       	     печати. Печать и шрифты. </li>
      		<li> Управление дисплеем: Изменение типа дисплея и видеоадаптера. Настройка разрешения и цветности. Оформление 
	       	     экрана. </li>
      		<li> Контроль и диагностика состояния Windows - среды с помощью встроенных системных средств. Внешние системные 
	       	     утилиты для контроля и оценки состояния системы. </li>
    	</ol>
	<b>Тема 4. Программирование в приложениях средствами VВА.</b>
	<ol>
		<li> Объекты в VВА. Синтаксис объектов VВА: синтаксис свойства; синтаксис метода.</li>
      		<li> Программирование объектов приложения. Описание и создание экземпляров объектов.</li>
      		<li> Создание модулей класса: создание свойств; создание методов. Использование элементов управления 
		     в приложениях VВА.</li>
      		<li> Программирование полей: установка и получение содержимого поля; запрет доступа к полю; получение выделенного
  	       	     текста в поле; установка выделенного текста в поле; установка размеров поля.</li>
      		<li> Программирование кнопок: нажатие кнопки; изменение состояния кнопки.</li>
      		<li> Программирование списков: задание числа выделенных элементов списка; добавление элементов списка; 
	       	     определение выделенного элемента списка; определение нескольких выделенных элементов списка; удаление 
		     элементов списка.</li>
      		<li> Программирование полей со списком: выбор типа поля со списком; заполнение поля со списком; установка и 
	       	     получение значения поля со списком.</li>
      		<li> Использование флажков: определение состояния флажка. Использование переключателей: определение выбранного 
	       	     переключателя. Программирование счетчика и выключателя. Использование наборов вкладок и полос прокрутки.</li>
      		<li> Отладка программы и обработка ошибок как часть процесса разработки программы. Типы ошибок.</li>
      		<li> Использование инструкции Option Explicit. Пошаговое выполнение программы. Режим прерывания. Использование 
	      	     окна отладки. Задание и использование точек останова.</li>
    	</ol>
</div>
