<div id = "main">
	<p class = "tit">Алгоритмические языки и программирование</p>
	<ol>
		<li> Классификация данных и операторов языка Паскаль.</li>
      		<li> Константы в языке Паскаль. Типы констант, правила формирования.</li>
      		<li> Данные в Турбо-Паскале. Типы данных: стандартные и пользовательские. Объем ОП, требуемый для каждого типа, 
	       	     допустимые операции над каждым типом данных. Совместимость и преобразование типов. Допустимые преобразования 
		     типов при вычислении выражений, при присваивании.</li>
      		<li> Массивы. Назначение. Объявление одномерных и многомерных массивов. Требуемая ОП. Допустимые операции над 
	             элементами массивов. Ввод и вывод данных массивов.</li>
      		<li> Записи. Назначение. Объявление фиксированных и вариантных записей и массивов записей. Обращение к полям 
	       	     (элементам) фиксированных записей. With - оператор присоединения. Ввод-вывод данных записей.</li>
      		<li> Множества. Назначение. Объявление множеств. Базовый тип элементов множества. Значения данных типа множество. 
	             Мощность множества. Множества-константы. Множества-переменные. Допустимые операции над множествами.</li>
      		<li> Типизированные константы. Назначение. Описание простых типизированных констант и констант-массивов. Форма 
	       	     объявления одномерных и многомерных типизированных констант-массивов. Обращение к элементам типизированных 
		     констант.</li>
      		<li> Оператор присваивания. Назначение и форма оператора. Процесс выполнения оператора присваивания. 
		     Типы выражений.	Приоритет операций различных типов. Правила выполнения смешанных выражений с 
		     операциями различных типов, содержащих скобки.</li>
      		<li> Операторы разветвления вычислений. Назначение и типы операторов разветвлений. Условный оператор If. 
		     Назначение	оператора. Схемы алгоритма для сокращенной и полной формы условного оператора. Сокращенная 
		     и полная форма условного оператора. Правила выполнения условного оператора.</li>
      		<li> Циклы. Назначение циклов. Вход и выход из цикла. Типы операторов цикла.</li>
      		<li> Классификация модулей Паскаля. Локализация объектов, используемых подпрограммами. Глобальные и локальные 
	       	     объекты. Область их действия. Формальные и фактические параметры. Назначение и область их действия. 
		     Вложенность и допустимые вызовы подпрограмм.</li>
      		<li> Процедуры.   Структура и описание процедуры. Форма вызова процедуры. Соответствие формальных и фактических 
	       	     параметров.</li>
	  	<li> Функции. Структура и описание функции. Форма вызова функции. Тип результата функции. Возвращение результата 
	       	     функции. Побочный эффект функции. Соответствие формальных и фактических параметров.</li>
      		<li> Параметры подпрограмм. Список формальных параметров: их состав и назначение. Область действия формальных 
	       	     параметров. Форма секции формальных параметров. Типы формальных параметров. Соответствие между списком 
		     формальных и фактических параметров. Виды формальных параметров.</li>
      		<li> Назначение и структура модулей. Интерфейсная часть. Исполняемая часть. Инициирующая часть. Область действия 
	       	     глобальных объектов модулей и основной программы. Структура интерфейсной, исполняемой и инициирующей части 
		     модуля. Компиляция модулей. Подключение модулей к программе.</li>
	  	<li> Классификация файлов. Назначение и основные характеристики файлов. Типы файлов Турбо-Паскаля. Объявление 
	       	     файлов различных типов. Стандартные файлы. Доступ к файлам. Открытие и закрытие файлов.</li>
      		<li> Типизированные файлы. Назначение файлов. Связь логического файла программы с физическим файлом. Оператор 
	       	     Assign. Типы компонент файла. Вывод данных в типизированный файл. Форма оператора Write. Ввод данных из 
		     типизированного файла. Форма оператора Read. Назначение процедур и функций Eof, Erase, IoResult, ReName, 
		     Seek, FileSize, FilePos и Truncate.</li>
	  	<li> Алгоритм. Свойство алгоритмов. Формы представления алгоритмов. Блоки для формирования схем алгоритмов.</li>
      		<li> Позиционные системы счисления. Правила перевода чисел из различных систем счисления 
		     в десятичную и наоборот</li>
	</ol>
</div>
