<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Дискретная математика</p>
	<ol>
		<li> Логика высказываний. Логические формулы. Логические операции. Таблицы истинности.</li>
      		<li> Равносильность формул логики высказываний. Свойства равносильности. Равносильные преобразования.</li>
      		<li> Логическое следствие. Его свойства. Логический вывод.</li>
      		<li> Предикат, его местность, область истинности. Подстановки. Логические операции над предикатами.</li>
      		<li> Кванторы. Составные префиксы. Отрицание выражений с кванторами. Эффект двойственности. Формулы логики 
	       	     предикатов и их равносильность.</li>
      		<li> Множество и его характеристический предикат. Теоретико-множественные операции, их связь с логическими 
	       	     операциями.</li>
      		<li> Отображения и функции. Композиция отображений. Обратные отображения. Основные классы отображений 
	      	     (инъекции, сюръекции и биекции).</li>
      		<li> Бинарные отношения. График, граф и матрица бинарного отношения. Основные классы бинарных отношений. 
	       	     Отношение эквивалентности. Операторы замыкания для бинарных отношений.</li>
      		<li> Графы и способы их задания. Матрицы смежности, достижимости и расстояний. Алгоритм нахождения матрицы 
	       	     достижимости по заданной матрице смежности.</li>
      		<li> Связность ориентированного и неориентированного графов. Компоненты связности. Алгоритм нахождения сильно 
	       	     связанных компонент ориентированного графа.</li>
    	</ol>
</div>
