<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Теория вероятности и математическая статистика</p>
	<ol>
		<li> Пространства элементарных событий (вероятное пространство). Алгебра и 
		     <img src=students/formuls/4.jpg>- алгебра событий. Дискретные вероятностные пространства. 
		     Классическое определение вероятности.</li>
      		<li> Случайная величина. Дискретная и непрерывная случайные величины. Функция распределения. Плотность 
	       	     распределения.</li>
      		<li> Многомерная случайная величина. Ее функция и плотность распределения. Маргинальные функция и плотность 
	       	     распределения.</li>
      		<li> Условная вероятность. Независимость случайных величин. Вид функции и плотность распределения многомерной 
	       	     случайной величины в случае независимости компонент.</li>
      		<li> Испытание Бернулли. Биномиальные вероятности. Распределение Бернулли и его характеристики.</li>
      		<li> Нормальное распределение и его характеристики. Формула Лапласа для нормального приближения распределения 
	       	     Бернулли.</li>
      		<li> Пуассоновское распределение и его характеристики. Пуассоновское приближение для распределения Бернулли.</li>
      		<li> Интеграл Стилтьеса по вероятностной мере. Математическое ожидание для дискретной и непрерывной случайной 
	       	     величины.</li>
      		<li> Дисперсия случайной величины. Ковариация двух случайных величин. Среднеквадратическое отношение. Коэффициент 
	       	     корреляции.</li>
      		<li> Свойства коэффициента корреляции. Условие, при котором модуль его равен единице. Смысл знака коэффициента 
	       	     корреляции.</li>
      		<li> Неравенство Чебышева. Доверительный интервал. Закон больших чисел в форме Чебышева.</li>
      		<li> Генеральная совокупность и выборка из нее. Эмпирическая функция распределения и гистограмма.</li>
	  	<li> Оценка параметра распределения, ее несмещенность и состоятельность. Оценки математического ожидания, дисперсии,
    	   	     ковариации, коэффициента корреляции.</li>
      		<li> Простая и сложная гипотезы в математической статистике. Общая схема построения статистических критериев. 
	       	     Правило проверки гипотезы. Ошибки первого и второго рода. Функция мощности и уровня значимости критерия.</li>
      		<li> Критерий   <img src=students/formuls/5.jpg>- статистика Пирсона и <img src=students/formuls/6.jpg>- 
	       	     распределение с n степенями свободы.</li>
    	</ol>
</div>
