<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Информационные структуры и методы обработки информации</p>
	<ol>
		<li> Стек. Определение стека. Реализация стека с использованием динамических структур. Основные операции для 
	       	     реализации стека: добавление в стек, чтение из стека, удаление из стека.</li>
      		<li> Стек. Примеры использования стека. Преобразование арифметических выражений.</li>
      		<li> Очередь. Определение очереди. Определение очереди. Реализация очереди с использованием динамических структур. 
	       	     Основные операции для реализации очереди: добавление в очередь, чтение из очереди, удаление из очереди.</li>
      		<li> Список. Определение списка. Реализация списка с использованием динамических структур. Основные операции для 
	       	     реализации списка: добавление в список, чтение из списка, удаление из списка.</li>
      		<li> Деревья. Определение дерева. Бинарные деревья. Реализация дерева с использованием динамических структур. 
	             Основные операции для реализации дерева: добавление элемента или ветви дерева, прохождение дерева, удаление 
		     элемента или ветви дерева. Обход дерева.</li>
      		<li> Графы. Определение графа. Связанное представление графов. Представление графа с использованием динамических 
	       	     структур. Типовые задачи, решаемые с помощью графов. Обход графа в глубину и в ширину.</li>
      		<li> Сортировка массивов. Назначение сортировки. Классификация методов сортировки. Критерии оценки 
		     различных методовсортировки.</li>
      		<li> Методы сортировки массивов</li>
      		<li> Сортировка последовательностей. Классификация и критерии оценки методов сортировки последовательностей. 
	       	     Методы сортировки последовательностей.</li>
      		<li> Рекурсия. Рекурсивные структуры данных. Рекурсивные функции. Реализация рекурсивных алгоритмов.</li>
      		<li> Поиск. Основные методы поиска.</li>
	</ol>
</div>
