<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Программные системы машинной графики</p>
	<ol>
		<li> Восприятие яркостной и цветовой информации. Цветовое зрение. Яркостная чувствительность.</li>
      		<li> Цветовые системы. Аддитивный цветовой синтез и цветовая система RGB. Субтрактивный цветовой синтез и цветовая 
	       	     система CMYK.</li>
      		<li> Цветовая система HSV и цветовой график МКО.</li>
      		<li> Оцифровка изображений.</li>
      		<li> Сжатие видеоданных без потерь.</li>
      		<li> Сжатие изображений с потерями.</li>
      		<li> Сжатие цифровых видеосюжетов.</li>
      		<li> Устройства для цифрового ввода изображений. Сканеры: типы, функции, характеристики, 
		     возможности. Видео АЦП.</li>
      		<li> Обработка оцифрованной информации. Технология OCR. </li>
      		<li> Хранение видеоданных. Форматы файлов для хранения изображений. </li>
      		<li> Устройство отображения графических изображений. Вывод оцифрованных изображений на экран компьютера. </li>
      		<li> Методы печати: полутоновая печать, приращение тоновой плотности при печати, значение правильного выбора 
	       	     разрешения изображения, цветная печать.</li>
	  	<li> Основы 3D- графики. Возможности ускорения 3D -графики. </li>
      		<li> Обработка оцифрованных изображений: разрешение, муар-эффект, сглаживание, оптимизация яркости и контрастности,
    	   	     выбор цветовых моделей.</li>
    </ol>
</div>
