<?php include_once("info/sidebar.php");?>
<div id = "main">
	<img class = "rightimg" src = 'info/photo/shema1.jpg'>
	<p class = "tit">Контакты</p>
	<p class = "subtit">Адрес:</p> 
	Московский Государственный Технический Университет Гражданской Авиации<br>
	Кафедра Прикладной Математики<br>
	Москва, улица Пулковская 6, корпус 4<br>
	<p class = "subtit">Телефоны:</p>
	Наделяева Людмила Михайловна, методист: (495) 458-84-16 <br>
	Кузнецов Валерий Леонидович, зав. кафедрой: (495) 458-84-16 <br>
</div>
