<?php include_once("info/sidebar.php"); ?>
<div id = "main">
	<p class = "tit"> Кафедра Прикладной Математики</p>
	<p>Кафедра прикладной математики входит в состав Факультета прикладной математики и вычислительной техники.
	Кафедра организована в 1994 году и является выпускающей по специальности 230401 - Прикладная математика.
	Выпускникам кафедры присваивается квалификация «инженер-математик».</p>
	<img src=info/photo/pic1.jpg class = "leftimg">
	<p>Основу прикладной математики, как специальности, составляют технологии математического моделирования, 
	т.е. технологии построения и исследования математических моделей различных систем и процессов в самых 
	разнообразных сферах человеческой деятельности: от разработки новейших промышленных технологий до анализа 
	задач социальной психологии. Универсальность методов математического моделирования, их эффективность и 
	относительная дешевизна делает прикладных математиков все более востребованными в современном мире.</p> 
	<img src=info/photo/pic2.jpg class = "rightimg">
	<p>На кафедре работают высококвалифицированные преподаватели – выпускники МГУ им М.В.Ломоносова и других ведущих 
	ВУЗов страны. Они обеспечивают подготовку студентов как по классическим курсам фундаментальных математических 
	дисциплин, так и в сфере современных компьютерных технологий.</p>
	<p>В распоряжении студентов имеется 3 компьютерных класса, оснащенных самым современным компьютерным оборудованием и 
	средствами мультимедиа для ведения лекций.</p>
	<p class="dec">Сферу научных интересов сотрудников кафедры можно охарактеризовать следующим перечнем научных направлений:</p>
  		<ul>
   			<li>математическое моделирование в задачах прикладной электродинамики;</li>
   			<li>математическое моделирование недоопределенных систем;</li>
   			<li>информационные системы в производственной деятельности;</li>
   			<li>математические модели в экономике и финансах.</li>
  		</ul> 
	<p class="dec">Научное руководство аспирантами осуществляют:</p>
 		<ul>  
   			<li>профессора А.А.Егорова, В.Л.Кузнецов, В.И.Котиков;</li> 
   			<li>доцент И.Б. Ивенин.</li>
		</ul>  
</div>
