<?php include_once("students/s_sidebar.php"); ?>
<div id = "main">
	<p class = "tit">Компьютерная графика</p>
	<ol>
		<li> Методы реализации двумерных моделей.</li>
      		<li> Внутреннее представление объектов при трехмерном моделировании.</li>
      		<li> Методы построения при формировании объектов.</li>
      		<li> Двумерные и трехмерные матричные преобразования при однородном координатном воспроизведении.</li>
      		<li> Методы проектирования трехмерных объектов.</li>
      		<li> Освещение пучком лучей и формирование теней объектов.</li>
      		<li> Растровая графика. Связность множеств пикселей. Алгоритм Брезенхема.</li>
      		<li> Методы растровой развертки: в реальном времени, групповое кодирование, клеточное кодирование.</li>
      		<li> Алгоритмы заполнения контуров. Методы устранения ступенчатости.</li>
      		<li> Алгоритмы отсечения.</li>
      		<li> Алгоритмы удаления невидимых линий и поверхностей.</li>
      		<li> Методы расчета освещенности объектов.</li>
    	</ol>
</div>
